HomeMoney_Expansions.ДомашняяБухгалтерияДополнение/src/Catalogs/ДБ_Задачи/ДБ_Задачи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДБ_Задачи</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Заказчик</name>
    <type>
      <types>CatalogRef.Контакты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОплаты</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Анадитика</name>
    <type>
      <types>CatalogRef.ДополнительныеЗначенияВидовАналитик</types>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.ДБ_СостоянияЗадач</types>
    </type>
  </attributes>
</mdclass:Catalog>

HomeMoney_Expansions.ДомашняяБухгалтерияДополнение/src/InformationRegisters/ДБ_Хронометраж/ДБ_Хронометраж.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДБ_Хронометраж</name>
  <resources>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>Задача</name>
    <type>
      <types>CatalogRef.ДБ_Задачи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

HomeMoney_Expansions.ДомашняяБухгалтерияДополнение/src/Enums/ДБ_СостоянияЗадач/ДБ_СостоянияЗадач.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ДБ_СостоянияЗадач</name>
  <enumValues>
    <name>Отменена</name>
  </enumValues>
  <enumValues>
    <name>Выполняется</name>
  </enumValues>
  <enumValues>
    <name>ПереданаЗаказчику</name>
  </enumValues>
  <enumValues>
    <name>Выполнена</name>
  </enumValues>
  <enumValues>
    <name>ВозвращенаНаДоработку</name>
  </enumValues>
</mdclass:Enum>

HomeMoney_Expansions.ДомашняяБухгалтерияДополнение/src/Catalogs/ДБ_Задачи/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Ключ.Пустая() Тогда
		Объект.Состояние = Перечисления.ДБ_СостоянияЗадач.Выполняется;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НачатьВыполнение(Команда)
	Если Модифицированность Тогда
		Записать();
	КонецЕсли;
	ПараметрыФормы = Новый Структура("Задача", Объект.Ссылка);
	ОткрытьФорму("РегистрСведений.ДБ_Хронометраж.Форма.ФормаВыполненияЗадачи", ПараметрыФормы, ЭтотОбъект,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ЗакончитьВыполнение(Команда)
	ЗакончитьВыполнениеНаСервере(Объект.Ссылка);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗакончитьВыполнениеНаСервере(Задача)
	РегистрыСведений.ДБ_Хронометраж.ЗавершениеВыполнения(Задача);
КонецПроцедуры // ЗакончитьВыполнениеНаСервере(Задача)
